In [2]:
version

               _
platform       x86_64-pc-linux-gnu
arch           x86_64
os             linux-gnu
system         x86_64, linux-gnu
status
major          3
minor          5.1
year           2018
month          07
day            02
svn rev        74947
language       R
version.string R version 3.5.1 (2018-07-02)
nickname       Feather Spray

### R에서 Java code 호출 
install.packages("rJava")
### Database Interface
install.packages("DBI")
### R에서 Mysql database 와 정보 교환
install.packages("RMySQL")

In [3]:
library(RMySQL)

Loading required package: DBI

# MySQL 연결

In [8]:
# DB Connection
conn <- dbConnect(MySQL(),
                 dbname = "education",
                 user = "root",
                 password = "1111",
                 host = "192.168.100.71")

In [9]:
dbListTables(conn)

[1] "advise"    "course"    "lecture"   "professor" "register"  "student"

In [10]:
# Table 의 Field 목록
dbListFields(conn,"professor")

[1] "pcode"    "pname"    "pdept"    "pphone"   "paddress"

# select

In [19]:
# Select
professor_list <- dbGetQuery(conn, "select * from professor")

In [20]:
professor_list

  pcode pname  pdept        pphone  paddress
1 P001  하은용 컴퓨터공학과 0001    서울
2 P002  안창호 컴퓨터공학과 0002    서울
3 P003  이육사 국문학과     0003    강원도
4 P004  박종화 국문학과     0004    경상북도
5 P005  심훈   사학과       0005    전라남도
6 P006  한용운 사학과       0006    충청남도
7 P010  이나래 심리학과     0010    충청도
8 P011  홍길동 사학과       0007    서울
9 P024  최고야 음악학과     0107331 송도

In [13]:
class(professor_list)

[1] "data.frame"

# Insert

In [25]:
# insert 
dbSendQuery(conn, "insert into professor values ('P024','최고야','음악학과','0107331','송도')")

# Delete

In [27]:
# delete
dbSendQuery(conn,"delete from professor where pcode = 'P024'")

In [30]:
dbGetQuery(conn, "select * from professor")

  pcode pname  pdept        pphone paddress
1 P001  하은용 컴퓨터공학과 0001   서울
2 P002  안창호 컴퓨터공학과 0002   서울
3 P003  이육사 국문학과     0003   강원도
4 P004  박종화 국문학과     0004   경상북도
5 P005  심훈   사학과       0005   전라남도
6 P006  한용운 사학과       0006   충청남도

# CSV 파일 넣기

In [41]:
data <- read.csv("../Data/score.csv",header = F)
data

   V1 V2  V3  V4
1   1  90  80  70
2   2  90  88  70
3   3  90  89  70
4   4  90  87  70
5   5  90  60  70
6   6 100 100 100
7   7 100 100 100
8   8 100 100 100
9   9 100 100 100
10 10 100 100 100

In [66]:
# 여기서 테이블을 바로 만들면 SQL에서 만들지 않아도 자동으로 생긴다.
dbWriteTable(conn,"score", data, overwrite = T ,row.names = F) # row.names 를 없애지 않으면 하나하나 이름이 들어감

[1] TRUE

In [44]:
dbGetQuery(conn, "select * from score")

   V1 V2  V3  V4
1   1  90  80  70
2   2  90  88  70
3   3  90  89  70
4   4  90  87  70
5   5  90  60  70
6   6 100 100 100
7   7 100 100 100
8   8 100 100 100
9   9 100 100 100
10 10 100 100 100

In [61]:
data2 <- read.csv("../Data/score2.csv",header = F)
data2

  V1 V2 V3 V4
1 11 90 80 70
2 12 90 88 70

In [67]:
# 그 전 방식은 데이터를 다 날리고 데이터를 넣는다
# 그 전 데이터를 가지고 추가하는 것
dbWriteTable(conn,"score", data2, overwrite = F ,row.names = F, append = T)

[1] TRUE

In [68]:
dbGetQuery(conn, "select * from score")

   V1 V2  V3  V4
1   1  90  80  70
2   2  90  88  70
3   3  90  89  70
4   4  90  87  70
5   5  90  60  70
6   6 100 100 100
7   7 100 100 100
8   8 100 100 100
9   9 100 100 100
10 10 100 100 100
11 11  90  80  70
12 12  90  88  70